Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: This command will produce as output a description of the current state of the repository, including modified files and unignored untracked files, and in addition it will show things like what files have been staged for the next commit, and usually some useful information about how to change things.
es: Este comando produce como resultado una descripción del estado actual del repositorio, que incluye los archivos modificados y los archivos sin seguimiento no ignorados; además, muestra cosas como los archivos que están preparado para la siguiente confirmación y, en general, información útil sobre cómo se pueden cambiar determinadas cosas.

source: This construct is useful when you want to capture one of a number of alternative matches.
es: Esta construcción es útil cuando se desea capturar una sola coincidencia de una serie de coincidencias alternativas.

source: This constructor knows about the attributes you declared, so you can set them when creating a new C<File>.
es: Este constructor sabe cuáles son los atributos declarados, por lo que puede establecerlos al crear una nueva instancia de C<Archivo>.

source: This constructor lets its parent class do the actual object construction.
es: Este constructor permite que sea la clase primaria la que se encargue de crear el objeto.

source: This convention was adopted by the community, and the second edition became I<Programming Perl>, using the capitalized version of the name to refer to the language.
es: La comunidad adoptó esta convención y la segunda edición pasó a llamarse I<Programming Perl>, con la versión con inicial mayúscula en el nombre para referirse al lenguaje.

source: This creates a local branch named C<maint-5.005>, which tracks the remote branch C<origin/maint-5.005>.
es: Esto crea una rama local denominada C<maint-5.005> que hace un seguimiento de la rama remota C<origin/maint-5.005>.

source: This demonstrates how C<SUPER> is resolved.
es: Este ejemplo ilustra la forma de resolución de C<SUPER>.

source: This directory contains I<all> of the modules and their tests, unlike other core modules.
es: A diferencia de otros módulos del núcleo, este directorio contiene I<todos> los módulos y sus pruebas.

source: This directory contains XS-using modules which are only released as part of the core.
es: Este directorio contiene módulos que usan XS y que solo se publican como parte del núcleo.

source: This directory contains dual-life modules where the CPAN module is canonical.
es: Este directorio contiene módulos de evolución dual en los que el módulo de CPAN es la versión canónica.

source: This directory contains pure-Perl modules which are only released as part of the core.
es: Este directorio contiene módulos programados en Perl puro que solo se publican como parte del núcleo.

source: This directory is for dual-life modules where the blead source is canonical.
es: Este directorio contiene módulos de evolución dual en los que la versión canónica es la del código fuente de la rama B<blead>.

source: This document aims to provide an overview of the vast perl community, which is far too large and diverse to provide a detailed listing.
es: Este documento tiene como objetivo proporcionar una visión general de la extensa comunidad Perl, demasiado grande y diversa como para poder ofrecer una descripción detallada.

source: This document aims to record the Perl source code releases.
es: Este documento se creó con el objetivo de conservar un registro de las versiones del código fuente de Perl.

source: This document assumes that you already understand the basics of Perl syntax, variable types, operators, and subroutine calls.
es: Suponemos que ya conoce y comprende la sintaxis de Perl, los tipos de variables y las llamadas a subrutinas.

source: This document describes all of Perl's object-oriented (OO) features from the ground up.
es: Sobre esta base, este documento describe todas las características de la orientación a objetos en Perl.

source: This document describes how Perl internally handles numeric values.
es: En este documento se describe el procesamiento interno de valores numéricos en Perl.

source: This document describes the layout of the Perl source tree.
es: En este documento se describe el contenido del árbol de código fuente de Perl.

source: This document describes various features of FreeBSD that will affect how Perl version 5 (hereafter just Perl) is compiled and/or runs.
es: En este documento se describen varias características de FreeBSD que afectan a la compilación y ejecución de Perl versión 5 (en lo sucesivo, Perl).

source: This document describes various features of OpenBSD that will affect how Perl version 5 (hereafter just Perl) is compiled and/or runs.
es: En este documento se describen varias características de OpenBSD que afectan a la compilación y ejecución de Perl versión 5 (en lo sucesivo, Perl).

source: This document exists to list all of these utilities, explain what they are for and provide pointers to each module's documentation, if appropriate.
es: Este documento contiene una descripción de las utilidades y referencias a la documentación de cada módulo (si existe).

source: This document gives you some suggestions about how to go about writing Perl modules, preparing them for distribution, and making them available via CPAN.
es: Este documento ofrece algunas sugerencias para escribir módulos Perl, preparar su distribución y publicarlos en CPAN.

source: This document is intended for people who are regular contributors to Perl, including those with write access to the git repository.
es: Este documento se destina a aquellas personas que contribuyan regularmente al desarrollo de Perl, incluidas las que tienen acceso de escritura al repositorio git.

source: This document is intended to give you a quick overview of the Perl programming language, along with pointers to further documentation.
es: Este documento proporciona una introducción rápida al lenguaje de programación Perl e incluye referencias a documentación adicional.

source: This document lists the current and past experimental features in the perl core.
es: En este documento se muestran las funcionalidades experimentales actuales y anteriores del núcleo de perl.

source: This document may be distributed under the same terms as Perl itself.
es: Puede distribuir este documento en los mismos términos que Perl.

source: This document needs a rewrite that separates the tutorial content from the reference content.
es: Este documento necesita una reescritura que separe el contenido de manual del contenido de referencia.

source: This document provides a reference for Perl's object orientation features.
es: Este documento es una referencia de las características de programación orientada a objetos que ofrece Perl.

source: This document provides an introduction to object-oriented programming in Perl.
es: Este documento proporciona una introducción a la programación orientada a objetos en Perl.

source: This document provides details on using git to develop Perl.
es: Este documento proporciona información detallada sobre el uso de git para el desarrollo de Perl.

source: This document takes you through a simple patch example.
es: Este documento describe la creación de un parche sencillo.

source: This document varies from difficult to understand to completely and utterly opaque.
es: El nivel de dificultad de este documento varía entre "difícil de entender" y "completa y totalmente opaco".

source: This document was created in February, 2011.
es: Creado en febrero de 2011.

source: This document was originally written by Nathan Torkington, and is maintained by the perl5-porters mailing list.
es: Actualmente la lista de correo perl5-porters se encarga de actualizar este documento redactado originalmente por Nathan Torkington.

source: This documentation is for people who want to download CPAN modules and install them on their own computer.
es: Este documento explica lo que hay que hacer para descargar e instalar módulos de CPAN.

source: This documentation is free; you can redistribute it and/or modify it under the same terms as Perl itself.
es: Esta documentación es libre; puede redistribuirla o modificarla en los mismos términos que Perl.

source: This doesn't do anything to your input, or to your output.
es: Esto no afecta ni a la entrada ni a la salida de datos.

source: This ease of experimentation flattens the learning curve even more.
es: Esta facilidad para realizar experimentos también allana la curva de aprendizaje.

source: This effectively means that the regex engine "skips" forward to this position on failure and tries to match again, (assuming that there is sufficient room to match).
es: Esto significa que, efectivamente, el motor de expresiones regulares "salta" hacia adelante a esta posición en caso de error y vuelve a intentar detectar una coincidencia (suponiendo que haya espacio suficiente para la coincidencia).

source: This effectively provides variable-length look-behind.
es: Esto ofrece la posibilidad efectiva de realizar inspecciones hacia atrás de longitud variable.

source: This ensures that all your work will be shown as a side branch, with all its commits merged into the mainstream blead by the merge commit.
es: Esto garantiza que se mostrará todo el trabajo como una rama paralela, con todas las confirmaciones combinadas en la rama blead principal mediante la combinación de mezcla.

source: This escape mechanism is also required for the character used as the pattern delimiter.
es: Este mecanismo de escape también es necesario para el carácter utilizado como delimitador de patrón.

source: This feature can be used together with the special variable C<$^N> to capture the results of submatches in variables without having to keep track of the number of nested parentheses.
es: Esta característica se puede utilizar con la variable especial C<$^N> para capturar los resultados de las coincidencias parciales en variables sin tener que seguir la pista del número de paréntesis anidados.

source: This file lists everyone who's contributed to Perl.
es: En este archivo figuran todas las personas que han contribuido a Perl.

source: This form, known as v-strings, provides an alternative, more readable way to construct strings, rather than use the somewhat less readable interpolation form C<"\x{1}\x{14}\x{12c}\x{fa0}">.
es: Esta forma, conocida como "v-string", ofrece una alternativa para crear cadenas más legible que una forma de interpolación como C<"\x{1}\x{14}\x{12c}\x{fa0}">.

source: This glossary is like a hash, where the word to be defined is the key, and the definition is the value.
es: Este glosario es como un hash, en el que una palabra definida es la clave y su definición el valor.

source: This happens immediately, so C<$^R> can be used from other C<(?{ code })> assertions inside the same regular expression.
es: Esto ocurre de forma inmediata, por lo que se puede usar C<$^R> en otras aserciones C<(?{ código })> dentro de la misma expresión regular.

source: This happens because the pattern match is in list context (since it is being assigned to the empty list), and will therefore return a list of all matching parts of the string.
es: Esto sucede porque la expresión regular está en contexto de lista (ya que se asigna a la lista vacía) y, por lo tanto, se obtendrá una lista de todas las coincidencias encontradas en la cadena.

source: This has the advantage of enforcing the encapsulation of object attributes, since their data is not stored in the object itself.
es: Esto presenta la ventaja de forzar la encapsulación de los atributos del objeto, ya que sus datos no se almacenan en el propio objeto.

source: This has several advantages.
es: Esto ofrece varias ventajas:

source: This implies nothing about the order of name lookups, however.
es: Sin embargo, esto no implica nada sobre el orden de búsqueda de los nombres.

source: This includes C<if>, basic file reads and writes, simple regexes, etc.
es: Incluyen pruebas de C<if>, operaciones básicas de lectura y escritura, expresiones regulares sencillas, etc.

source: This includes the object itself.
es: Esto incluye al propio objeto.

source: This interpolation combines with the facts that the opening and closing parentheses are optional (except when necessary for precedence) and lists may end with an optional comma to mean that multiple commas within lists are legal syntax.
es: Esta interpolación combinada con el hecho de que los paréntesis de apertura y cierre son opcionales (salvo cuando sea necesario por razones de precedencia) y que las listas pueden terminar con una coma opcional, indica que el uso de comas múltiples dentro de las listas es sintaxis válida.

source: This introductory document does not aim to be complete.
es: Es un documento introductorio, no una guía completa.

source: This is <not> a substitute for reading the README and INSTALL files that might have come with your module!
es: Leer esta información B<no> le exime de la lectura de los archivos README e INSTALL incluidos en un módulo.

source: This is important, because it lets methods at different levels within a deep inheritance hierarchy each correctly call their respective parent methods.
es: Esto es importante, ya que permite que métodos de distintos niveles de una jerarquía de herencia de muchos niveles llamen correctamente a sus respectivos métodos en la clase primaria correspondiente.

source: This is widely accepted as good behavior when you're writing, but it can be dangerous when reading, because it causes internal inconsistency when you have invalid byte sequences.
es: Esto está aceptado universalmente como una práctica fiable al escribir, pero puede ser peligroso al leer, ya que crea una incoherencia interna cuando hay secuencias de bytes no válidas.

source: This is a "postponed" regular subexpression.
es: Esta es una subexpresión regular "pospuesta".

source: This is a kind of L</interface>--the underlying L</implementation> may well break your data up into separate packets for delivery, but this is hidden from you.
es: Es un tipo de L</interfaz>; la L</implementación> subyacente puede dividir los datos en paquetes independientes para su entrega, pero estos detalles se ocultan.

source: This is a list of questions and answers about Unicode in Perl, intended to be read after L<perlunitut>.
es: Esta lista de preguntas y respuestas sobre Unicode en Perl debe leerse después de leer L<perlunitut>.

source: This is a perfect example of composition.
es: Este es un ejemplo perfecto de composición.

source: This is a possible, but quite pathological.
es: Esto es posible, pero realmente patológico.

source: This is a reference card for people who are familiar with the C library and who want to do things the Perl way; to tell them which functions they ought to use instead of the more normal C functions.
es: Este documento es una hoja de referencia para programadores que conocen la biblioteca de C y desean hacer las cosas al estilo de Perl. Indica las funciones que deben usar en lugar de las funciones de C de uso común.

source: This is a term used both for characters with an ordinal value greater than 127, characters with an ordinal value greater than 255, or any character occupying more than one byte, depending on the context.
es: Este término se usa para definir los caracteres que tienen un valor ordinal mayor que 127, los caracteres que tienen un valor ordinal mayor que 255 o cualquier carácter que ocupe más de un byte, según el contexto.

source: This is actually just a wrapper around the C<-M> switch; using C<-oI<formatname>> just looks for a loadable class by adding that format name (with different capitalizations) to the end of different classname prefixes.
es: En realidad es un encapsulador del modificador C<-M>; si se usa C<-oI<nombre_formato>>, solo busca una clase que se pueda cargar agregando ese nombre de formato (con distintas combinaciones de mayúsculas y minúsculas) al final de distintos prefijos de nombre de clase.

# This is anti-obfuscated code. ";
source: This is anti-obfuscated code.\n";
es: Esto es lo contrario de código ofuscado.\n";

source: This is applicable to the third and fourth arguments of C<sysread>, for example.
es: Esto es aplicable, por ejemplo, a los argumentos tercero y cuarto de C<sysread>.

source: This is because Perl tends to reimplement or abstract standard library functions, so that we know exactly how they're going to operate.
es: Esto se debe a que en el desarrollo de Perl se ha seguido la tendencia de reimplementar o abstraer funciones de la biblioteca estándar, para controlar cómo van a funcionar exactamente.

source: This is best demonstrated with this code:
es: Esto se ilustra mejor con el código siguiente:

source: This is both common and safe.
es: Esto es habitual y seguro.

source: This is called B<encapsulation>.
es: Esto se denomina B<encapsulación>.

source: This is called B<composition>, or a B<has-a> relationship.
es: Esto se denomina B<composición>, o relación "tiene-un" (B<has-a> en inglés).

source: This is called a I<backreference>.
es: Esto se denomina I<retrorreferencia>.

source: This is called an "array slice".
es: Esto se denomina una "porción de array".

source: This is called just like any other method, with the object as the first argument.
es: Se llama de la misma manera que cualquier otro método, con el objeto como primer argumento.

source: This is deprecated in favour of F<h2xs> these days.
es: Han quedado obsoletos desde que surgió F<h2xs>.

source: This is described in more detail below and in L<perlref>.
es: Esto se describe con mayor detalle más abajo y en L<perlref>.

source: This is exactly equivalent to
es: Eso equivale exactamente a

source: This is exactly equivalent to writing C<< $sub->($file) >>.
es: Esto equivale exactamente a escribir C<< $sub->($archivo) >>.

source: This is for clustering, not capturing; it groups subexpressions like "()", but doesn't make backreferences as "()" does.
es: Este es para agrupación, no para captura; agrupa subexpresiones como lo hace "()", pero a diferencia de "()" no crea retrorreferencias.

source: This is grandfathered (for \1 to \9) for the RHS of a substitute to avoid shocking the B<sed> addicts, but it's a dirty habit to get into.
es: Son vicios adquiridos (por \1 a \9) en el lado derecho de una sustitución para no escandalizar a los adictos a B<sed>, pero es un hábito poco recomendable.

source: This is handy when you want to do a list assignment in a Boolean context, because most list functions return a null list when finished, which when assigned produces a 0, which is interpreted as FALSE.
es: Esto es útil cuando se quiere hacer una asignación de lista en un contexto booleano, ya que la mayoría de funciones de lista, al terminar de ejecutarse devuelven una lista nula que, al asignarse, produce un 0, lo que se interpreta como FALSO.

source: This is how it is able to function as a pragma mechanism, and also how modules are able to declare subroutines that are then visible as list or unary operators for the rest of the current file.
es: Esto es lo que permite a un módulo funcionar como un mecanismo pragma y declarar subrutinas que están visibles incluso como operadores de lista o unarios para el resto del archivo actual.

source: This is just a shorthand for a typeglob assignment at compile time:
es: Esto no es más que una forma abreviada de asignación de I<typeglob> en tiempo de compilación:

source: This is nice, but if you forget your trailing quote, the error will not be reported until Perl finds another line containing the quote character, which may be much further on in the script.
es: Esto está bien, pero si se le olvida cerrar el entrecomillado, no se notificará el error hasta que Perl encuentre otra línea que contenga el carácter de comilla, que puede estar mucho más abajo en el programa.

source: This is particularly important if you intend to compile the definitions with the C<qr//> operator, and later interpolate them in another pattern.
es: Esto es especialmente importante si se tiene la intención de compilar las definiciones con el operador C<qr//> y más tarde interpolarlas en otro patrón.

source: This is particularly useful for dynamic patterns, such as those read in from a configuration file, taken from an argument, or specified in a table somewhere.
es: Esto es especialmente útil para los patrones dinámicos, como los que se leen desde un archivo de configuración, se reciben como un argumento o se especifican en alguna tabla.

source: This is presumably useful in cases of on/off features like: C<-w page_numbering>.
es: Esto puede ser útil para características que se activan o desactivan, como por ejemplo C<-w page_numbering>.

source: This is pretty much useful only to find out whether Perl's internal hashing algorithm is performing poorly on your data set.
es: Esto solo es útil para averiguar si el algoritmo interno de almacenamiento en hash de Perl está teniendo un bajo rendimiento para un conjunto de datos.

source: This is primarily used for the documentation for the perl library modules.
es: Este programa se usa principalmente para consultar la documentación de los módulos de biblioteca de perl.

source: This is provided as a more readable version of C<if (!I<condition>)>.
es: Esto se proporciona como una versión más legible de C<if (!I<condición>)>.

source: This is purely a matter of convention, so a class may contain both methods and subroutines which I<don't> operate on an object or class.
es: Esto es solo un convenio, por lo que una clase puede contener en realidad tanto métodos como subrutinas que I<no> operen sobre objetos o clases.

source: This is set up with the L<overload> L</pragma>.
es: Se configura con el L</pragma> L<overload>.

source: This is similar to the "cut group" operator C<::> from Perl 6.
es: Este patrón es similar al operador C<::> "grupo de corte" de Perl 6.

source: This is simply a list of scalars, each of which is a string that corresponds to a package name.
es: Se trata de una simple lista de escalares, cada uno de los cuales es una cadena que se corresponde con un nombre de paquete.

source: This is simply done using a hash and Scalar::Util::weaken().
es: Esto se hace de forma sencilla mediante un hash y Scalar::Util::weaken().

source: This is something you, the programmer, has to keep track of; sorry.
es: De esto debe encargarse el programador.

source: This is the "branch reset" pattern, which has the special property that the capture groups are numbered from the same starting point in each alternation branch.
es: Este es el patrón de "reinicio de rama", que tiene la propiedad especial de numerar los grupos de captura desde el mismo punto inicial en cada rama alternativa.

source: This is the Perl 6 "commit pattern" C<< <commit> >> or C<:::>.
es: Este es "patrón de compromiso" C<< <commit> >> o C<:::> de Perl 6.

source: This is the case with the default branch C<blead> which will be configured to merge from the remote tracking branch C<origin/blead>.
es: Este es el caso de la rama predeterminada, C<blead>, que se configurará para combinarse desde la rama de seguimiento remoto C<origin/blead>.

source: This is the most important part of this tutorial.
es: Ésta es la parte más importante del tutorial.

source: This is used by L</string> comparison routines to decide, for example, where in this glossary to put "collating sequence".
es: Se usa en rutinas de comparación de L<cadenas|/cadena> para decidir, por ejemplo, en qué parte de este glosario debe ir "secuencia de intercalación".
